app/Http/Controllers/Auth/SocialLoginController.php

select * from `users` where (`provider` = 'google' and `provider_id` = '104627642321913949947') and `users`.`deleted_at` is null limit 1
---
    public function callback($provider)
    {
        try {
            $provider_user = Socialite::driver($provider)->user();

            $user = User::where([
                'provider' => $provider,
                'provider_id' => $provider_user->id,
            ])->first();