app/Http/Controllers/Api/ZoneController.php

    public function getZonesByCity($cityId)
    {
        $zones = Zone::where('city_id', $cityId)->get(['id', 'name']);
---
select `id`, `name` from `zones` where `city_id` = '4'