app/Http/Controllers/ContactController.php

select `name`, `title`, `subtitle` from `pages` where `name` = 'contact' limit 1
---
    public function index()
    {
        $page = Page::where('name', 'contact')->select('name', 'title', 'subtitle')->first();