app/Http/Controllers/FavoriteController.php

    public function index(Request $request)
    {
        $page = Page::where('name', 'favorites')->select('name', 'title', 'subtitle')->first();
---
select `name`, `title`, `subtitle` from `pages` where `name` = 'favorites' limit 1