app/Http/Controllers/HomeController.php

select `name`, `title`, `subtitle` from `pages` where `name` = 'home' limit 1
select * from `cities`
select * from `categories`
select * from `cities` where `cities`.`id` in (1, 4)
select * from `zones` where `zones`.`id` in (6, 49, 52)
select exists(select * from `properties` inner join `favorites` on `properties`.`id` = `favorites`.`property_id` where `favorites`.`user_id` = 3 and `property_id` = 8 and `properties`.`deleted_at` is null) as `exists`
select exists(select * from `properties` inner join `favorites` on `properties`.`id` = `favorites`.`property_id` where `favorites`.`user_id` = 3 and `property_id` = 9 and `properties`.`deleted_at` is null) as `exists`
select * from `blogs` order by `created_at` desc limit 1
select * from `blogs` order by `created_at` desc limit 2 offset 1
---
    public function index()
    {
        $user = Auth::user();

        $page = Page::where('name', 'home')->select('name', 'title', 'subtitle')->first();

        $cities = City::all();

        $categories = Category::all();

        $randomProperties = Property::available()->with('city', 'zone')->inRandomOrder()->take(6)->get();

        $randomProperties->transform(function ($property) use ($user) {
            $property->is_favorited = Auth::check() && $user->favorites()->where('property_id', $property->id)->exists();
            return $property;
        });

        $latestProperties = Property::available()->with('city', 'zone')->latest()->take(3)->get();

        $latestProperties->transform(function ($property) use ($user) {
            $property->is_favorited = Auth::check() && $user->favorites()->where('property_id', $property->id)->exists();
            return $property;
        });

        $mainBlog = Blog::latest()->first();

        $blogs = Blog::latest()->offset(1)->take(2)->get();