app/Http/Controllers/ProfileController.php

select `name`, `title`, `subtitle` from `pages` where `name` = 'profile' limit 1
---
    public function index()
    {
        $page = Page::where('name', 'profile')->select('name', 'title', 'subtitle')->first();