app/Http/Controllers/PropertiesController.php

    public function index(Request $request)

    {
        $page = Page::where('name', 'properties.index')->select('name', 'title', 'subtitle')->first();
---
select `name`, `title`, `subtitle` from `pages` where `name` = 'properties.index' limit 1

            }
        });

        $properties = $query->with('user', 'zone', 'city')->paginate(12);
---
select * from `cities` where `cities`.`id` in (1, 4)
select * from `users` where `users`.`id` in (3, 4) and `users`.`deleted_at` is null
select * from `zones` where `zones`.`id` in (6, 49, 52)

            ]);
        }

        $cities = City::all();
        $categories = Category::all();
---
select * from `cities`
select * from `categories`

    public function create()
    {
        $page = Page::where('name', 'properties.create')->select('name', 'title', 'subtitle')->first();
---
select `name`, `title`, `subtitle` from `pages` where `name` = 'properties.create' limit 1

        }

        // Create the property
        $property = Property::create($propertyData);
---
insert into `properties` (`user_id`, `zone_id`, `city_id`, `category_id`, `title`, `description`, `price`, `currency`, `location`, `type`, `area`, `rooms`, `bathrooms`, `date`, `status`, `owner_phone`, `main_image`, `updated_at`, `created_at`) values (4, '6', '1', '4', 'أرض في حي الشجاعية', 'أرض فارغة وتحتوي على غاطس (بئر) وبالقرب من الشارع الرئيسي', '18000', 'JOD', 'الشجاعية، على بعد 200 متر من صلاح الدين', 'sale', '230', null, null, '2025-08-10 23:14:25', 'available', '0592431798', 'uploads/properties/main/36676953917548568652.jpeg', '2025-08-10 23:14:25', '2025-08-10 23:14:25')

                $directory = 'uploads/properties/additional';
                $file_name = rand() . time() . $image->getClientOriginalName();
                $image_path = $image->storeAs($directory, $file_name, 'public_uploads');
                $property->images()->create([
                    'image_path' => $image_path,
                ]);
---
insert into `images` (`image_path`, `property_id`, `updated_at`, `created_at`) values ('uploads/properties/additional/64148289917548568651.jpg', 9, '2025-08-10 23:14:25', '2025-08-10 23:14:25')