app/Providers/AppServiceProvider.php

select exists(select * from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` = 4 and exists (select * from `role_abilities` where `roles`.`id` = `role_abilities`.`role_id` and `ability` = 'users.display')) as `exists`
---
    public function boot(): void
    {

        Broadcast::routes(['middleware' => 'auth']);

        Sanctum::usePersonalAccessTokenModel(PersonalAccessToken::class);

        Carbon::setLocale('ar');

        Gate::before(function ($user, $ability) {
            if ($user->super_admin) {
                return true;
            }
        });

        foreach (require base_path('data/abilities.php') as $ability => $label) {
            Gate::define($ability, function ($user) use ($ability) {
                return $user->roles()->whereHas('abilities', function ($query) use ($ability) {
                    $query->where('ability', $ability);
                })->exists();