app/Providers/SettingsServiceProvider.php

select `value`, `key` from `settings`
---
    public function register(): void
    {
        $this->app->singleton('settings', function () {
            return Setting::pluck('value', 'key')->toArray();

select count(*) as aggregate from `contacts` where `is_open` = 0
select * from `favorites`
---
    public function boot(): void
    {
        // Cache::remember('settings', 3600, function () {
        //     return Setting::pluck('value', 'key')->toArray();
        // });



        View::composer('dashboard.layouts.main-sidebar', function ($view) {
            $messages_count = Contact::where('is_open', 0)->count();
            $view->with('contact_messages', $messages_count);
        });

        View::composer('front.components.favorites', function ($view) {
            $favorites = Favorite::all();